Ran Plan for 2 projects:

1. dir: `infra/us-east-1/dev/eks/kubevela-addons` workspace: `default`
1. dir: `infra/us-east-1/prod/eks/green/kubevela-addons` workspace: `default`

### 1. dir: `infra/us-east-1/dev/eks/kubevela-addons` workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # helm_release.cardano[0] will be updated in-place
!   resource "helm_release" "cardano" {
        id                         = "cardano"
        name                       = "cardano"
!       version                    = "v0.0.6" -> "v0.0.10"
        # (25 unchanged attributes hidden)
    }

  # kubectl_manifest.traitdefinition_nixbuildnet will be created
+   resource "kubectl_manifest" "traitdefinition_nixbuildnet" {
+       api_version             = "core.oam.dev/v1beta1"
+       apply_only              = false
+       force_conflicts         = false
+       force_new               = false
+       id                      = (known after apply)
+       kind                    = "TraitDefinition"
+       live_manifest_incluster = (sensitive value)
+       live_uid                = (known after apply)
+       name                    = "nixbuildnet"
+       namespace               = "vela-system"
+       server_side_apply       = false
+       uid                     = (known after apply)
+       validate_schema         = true
+       wait_for_rollout        = true
+       yaml_body               = (sensitive value)
+       yaml_body_parsed        = <<-EOT
            apiVersion: core.oam.dev/v1beta1
            kind: TraitDefinition
            metadata:
              annotations:
                definition.oam.dev/description: Allow an Application to connect to Nixbuild.net
              name: nixbuildnet
              namespace: vela-system
            spec:
              appliesToWorkloads:
              - deployments.apps
              - statefulsets.apps
              - daemonsets.apps
              - jobs.batch
              conflictsWith: []
              podDisruptive: true
              schematic:
                cue:
                  template: "parameter: {\n    secretName?: \"nbn\" | string\n}\n\n#PatchConfig:
                    {\n  nix: {\n    volumes: [{\n        name: \"configmap-nix\"\n        configMap:
                    {\n            defaultMode: 420\n            name: \"cm-\\( context.name )-nix\"\n
                    \       }\n    }]\n    mountPath: \"/etc/nix\"\n    }\n   ssh: {\n    volumes:
                    [{\n        name: \"configmap-ssh\"\n        configMap: {\n            defaultMode:
                    420\n            name: \"cm-\\( context.name )-ssh\"\n        }\n    }]\n
                    \   mountPath: \"/etc/ssh\"\n    }\n}\n\noutputs: {\n    configmapNix: {\n
                    \       apiVersion: \"v1\"\n        data: \"nix.conf\": \"\"\"\n            store
                    = ssh-ng://eu.nixbuild.net\n            experimental-features = nix-command
                    flakes\n            require-sigs = true\n            substituters = https://cache.nixos.org/
                    https://cache.iog.io ssh://eu.nixbuild.net\n            trusted-public-keys
                    = cache.nixos.org-1:6NCHdD59X431o0gWypbMrAURkbJ16ZPMQFGspcDShjY= hydra.iohk.io:f/Ea+s+dFdN+3Y/G+FDgSq+a5NEWhJGzdjvKNGv0/EQ=
                    nixbuild.net/smart.contracts@iohk.io-1:s2PhQXWwsZo1y5IxFcx2D/i2yfvgtEnRBOZavlA8Bog=\n\n
                    \           \"\"\"\n        kind: \"ConfigMap\"\n        metadata: {\n            name:
                    \"cm-\\( context.name )-nix\"\n            namespace: context.namespace\n
                    \       }\n    }\n    configmapSsh: {\n        apiVersion: \"v1\"\n        data:
                    {\n            ssh_config: \"\"\"\n                Host eu.nixbuild.net\n
                    \               PreferredAuthentications none\n                User authtoken\n
                    \               SendEnv token\n\n                Host *\n                AddressFamily
                    any\n                GlobalKnownHostsFile /etc/ssh/ssh_known_hosts\n                \"\"\"\n
                    \           ssh_known_hosts: \"\"\"\n                eu.nixbuild.net ssh-ed25519
                    AAAAC3NzaC1lZDI1NTE5AAAAIPIQCZc54poJ8vqawd8TraNryQeJnvH1eLpIDgbiqymM\n                \"\"\"\n
                    \       }\n        kind: \"ConfigMap\"\n        metadata: {\n            name:
                    \"cm-\\( context.name )-ssh\"\n            namespace: context.namespace\n
                    \       }\n    }\n}\n\npatch: spec: template: spec: {\n\t// +patchKey=name\n\tvolumes:
                    [\n        #PatchConfig.nix.volumes[0],\n        #PatchConfig.ssh.volumes[0]\n
                    \   ]\n\t// +patchKey=name\n    containers: [{\n\t\tname: context.name\n        env:
                    [{\n            name: \"token\"\n            valueFrom: secretKeyRef: {\n
                    \               key: \"token\"\n                name: [\n                    if
                    parameter.secretName != _|_ { parameter.secretName },\n                    \"nbn\"\n
                    \               ][0]\n            }\n        }]\n        volumeMounts: [{\n
                    \           name: #PatchConfig.nix.volumes[0].name\n            mountPath:
                    #PatchConfig.nix.mountPath\n        },{\n            name: #PatchConfig.ssh.volumes[0].name\n
                    \           mountPath: #PatchConfig.ssh.mountPath\n        }]  \n    }]\n}"
        EOT
+       yaml_incluster          = (sensitive value)
    }

Plan: 1 to add, 1 to change, 0 to destroy.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d infra/us-east-1/dev/eks/kubevela-addons`
* :put_litter_in_its_place: To **delete** this plan click [here](http://k8s-default-atlantis-91ad56e657-af175fe4f3d67964.elb.us-east-1.amazonaws.com/lock?id=input-output-hk%252Fsc-dev-platform%252Finfra%252Fus-east-1%252Fdev%252Feks%252Fkubevela-addons%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d infra/us-east-1/dev/eks/kubevela-addons`
</details>
Plan: 1 to add, 1 to change, 0 to destroy.

---
### 2. dir: `infra/us-east-1/prod/eks/green/kubevela-addons` workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # kubectl_manifest.traitdefinition_nixbuildnet will be created
+   resource "kubectl_manifest" "traitdefinition_nixbuildnet" {
+       api_version             = "core.oam.dev/v1beta1"
+       apply_only              = false
+       force_conflicts         = false
+       force_new               = false
+       id                      = (known after apply)
+       kind                    = "TraitDefinition"
+       live_manifest_incluster = (sensitive value)
+       live_uid                = (known after apply)
+       name                    = "nixbuildnet"
+       namespace               = "vela-system"
+       server_side_apply       = false
+       uid                     = (known after apply)
+       validate_schema         = true
+       wait_for_rollout        = true
+       yaml_body               = (sensitive value)
+       yaml_body_parsed        = <<-EOT
            apiVersion: core.oam.dev/v1beta1
            kind: TraitDefinition
            metadata:
              annotations:
                definition.oam.dev/description: Allow an Application to connect to Nixbuild.net
              name: nixbuildnet
              namespace: vela-system
            spec:
              appliesToWorkloads:
              - deployments.apps
              - statefulsets.apps
              - daemonsets.apps
              - jobs.batch
              conflictsWith: []
              podDisruptive: true
              schematic:
                cue:
                  template: "parameter: {\n    secretName?: \"nbn\" | string\n}\n\n#PatchConfig:
                    {\n  nix: {\n    volumes: [{\n        name: \"configmap-nix\"\n        configMap:
                    {\n            defaultMode: 420\n            name: \"cm-\\( context.name )-nix\"\n
                    \       }\n    }]\n    mountPath: \"/etc/nix\"\n    }\n   ssh: {\n    volumes:
                    [{\n        name: \"configmap-ssh\"\n        configMap: {\n            defaultMode:
                    420\n            name: \"cm-\\( context.name )-ssh\"\n        }\n    }]\n
                    \   mountPath: \"/etc/ssh\"\n    }\n}\n\noutputs: {\n    configmapNix: {\n
                    \       apiVersion: \"v1\"\n        data: \"nix.conf\": \"\"\"\n            store
                    = ssh-ng://eu.nixbuild.net\n            experimental-features = nix-command
                    flakes\n            require-sigs = true\n            substituters = https://cache.nixos.org/
                    https://cache.iog.io ssh://eu.nixbuild.net\n            trusted-public-keys
                    = cache.nixos.org-1:6NCHdD59X431o0gWypbMrAURkbJ16ZPMQFGspcDShjY= hydra.iohk.io:f/Ea+s+dFdN+3Y/G+FDgSq+a5NEWhJGzdjvKNGv0/EQ=
                    nixbuild.net/smart.contracts@iohk.io-1:s2PhQXWwsZo1y5IxFcx2D/i2yfvgtEnRBOZavlA8Bog=\n\n
                    \           \"\"\"\n        kind: \"ConfigMap\"\n        metadata: {\n            name:
                    \"cm-\\( context.name )-nix\"\n            namespace: context.namespace\n
                    \       }\n    }\n    configmapSsh: {\n        apiVersion: \"v1\"\n        data:
                    {\n            ssh_config: \"\"\"\n                Host eu.nixbuild.net\n
                    \               PreferredAuthentications none\n                User authtoken\n
                    \               SendEnv token\n\n                Host *\n                AddressFamily
                    any\n                GlobalKnownHostsFile /etc/ssh/ssh_known_hosts\n                \"\"\"\n
                    \           ssh_known_hosts: \"\"\"\n                eu.nixbuild.net ssh-ed25519
                    AAAAC3NzaC1lZDI1NTE5AAAAIPIQCZc54poJ8vqawd8TraNryQeJnvH1eLpIDgbiqymM\n                \"\"\"\n
                    \       }\n        kind: \"ConfigMap\"\n        metadata: {\n            name:
                    \"cm-\\( context.name )-ssh\"\n            namespace: context.namespace\n
                    \       }\n    }\n}\n\npatch: spec: template: spec: {\n\t// +patchKey=name\n\tvolumes:
                    [\n        #PatchConfig.nix.volumes[0],\n        #PatchConfig.ssh.volumes[0]\n
                    \   ]\n\t// +patchKey=name\n    containers: [{\n\t\tname: context.name\n        env:
                    [{\n            name: \"token\"\n            valueFrom: secretKeyRef: {\n
                    \               key: \"token\"\n                name: [\n                    if
                    parameter.secretName != _|_ { parameter.secretName },\n                    \"nbn\"\n
                    \               ][0]\n            }\n        }]\n        volumeMounts: [{\n
                    \           name: #PatchConfig.nix.volumes[0].name\n            mountPath:
                    #PatchConfig.nix.mountPath\n        },{\n            name: #PatchConfig.ssh.volumes[0].name\n
                    \           mountPath: #PatchConfig.ssh.mountPath\n        }]  \n    }]\n}"
        EOT
+       yaml_incluster          = (sensitive value)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d infra/us-east-1/prod/eks/green/kubevela-addons`
* :put_litter_in_its_place: To **delete** this plan click [here](http://k8s-default-atlantis-91ad56e657-af175fe4f3d67964.elb.us-east-1.amazonaws.com/lock?id=input-output-hk%252Fsc-dev-platform%252Finfra%252Fus-east-1%252Fprod%252Feks%252Fgreen%252Fkubevela-addons%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d infra/us-east-1/prod/eks/green/kubevela-addons`
</details>
Plan: 1 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`